{
    "main": {
        "name": "Udo Schlegel",
        "occupation": "AI PostDoc researcher and AI freelance consultant",
        "description": "I am interested in artificial intelligence, especially deep learning and explainable AI, and cyber security. My current research revolves around explainable AI for time series models either trained supervised (classification) or unsupervised (clustering) to reveal learned patterns and increase the transparency of AI models.",
        "image": "udo-schlegel-k.jpg",
        "bio": "Hi, I’m Udo. I’m a Postdoctoral researcher at Ludwig-Maximilians-Universität (LMU) Munich and the Munich Center for Machine Learning (MCML). I also work as a freelance consultant and am open to research and industry projects. My work focuses on artificial intelligence, particularly deep learning, explainable AI, and cybersecurity. I’m especially interested in making AI systems more transparent and understandable. My current research explores explainable methods for time series models in both supervised and unsupervised settings, aiming to uncover the patterns these models learn. Beyond the technical side, I enjoy thinking and talking about the ethical limits of AI and how human behavior can be responsibly modeled using AI.",
        "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
        "email": "udo.schlegel@lmu.de",
        "phone": "",
        "address": {
            "street": "Oettingenstraße 67",
            "city": "Munich",
            "state": "Bavaria",
            "zip": "80538"
        },
        "website": "merowech.github.io",
        "social": [
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/udo-schlegel",
                "className": "fa fa-linkedin"
            }, {
                "name": "github",
                "url": "http://github.com/merowech",
                "className": "fa fa-github"
            }
        ]
    },
    "resume": {
        "education": [
            {
                "school": "University of Konstanz",
                "degree": "Dr. rer. nat., Computer Science",
                "graduated": "December 2024",
                "description": "Focus on explainable AI and visual explainable AI for time series with the title: 'Visual Explainable AI for Time Series Classification: The potential of attributions and counterfactuals'."
            }, {
                "school": "University of Konstanz",
                "degree": "M.Sc., Computer and Information Science",
                "graduated": "July 2018",
                "description": "Focus on Machine Learning and especially Deep Learning with the title: 'Towards Crime Forecasting Using Deep Learning'"
            }, {
                "school": "University of Konstanz",
                "degree": "B.Sc., Information Engineering",
                "graduated": "October 2016",
                "description": "Focus on Machine Learning and Visualization with the title: 'Interaktive Unterstützung für Malware: Klassifikation'"
            }
        ],
        "work": [
            {
                "company": "LMU Munich / Munich Center for Machine Learning",
                "title": "PostDoc",
                "years": "March 2025 - Now",
                "description": "I got the offer to continue my resarch as a PostDoc to further explore explainable AI for time series models and apply my research to real world problems in collaboration with industry partners. I further have the opportunity to supervise Bachelor / Master / and Phd students."
            }, {
                "company": "Corpuls",
                "title": "Data Scientist",
                "years": "November 2024 - March 2025",
                "description": "Developed machine learning models for medical time series data to support emergency medical services in decision making and patient monitoring."
            }, {
                "company": "University of Konstanz",
                "title": "PhD Candidate & Research Associate",
                "years": "October 2018 - December 2024",
                "description": "I was lucky to get an offer not many people get after their master. I could either go the industry and start a career as a data scientist or software engineer or I could stay at the university doing what I am interested in: machine learning, visual data analysis, and research."
            }, {
                "company": "Huawei Research Center Germany",
                "title": "PhD Intern for AI",
                "years": "November 2021 - April 2022",
                "description": "Developed and deployed a state-of-the-art Graph Neural Network architecture for the Huawei Ascend platform, specializing in relational graphs, while also conducting research and implementing explainable AI techniques and evaluation methods for GNNs."
            }, {
                "company": "Steinbeis Kompetenzzentrum",
                "title": "Data Scientist & Software Engineer",
                "years": "April 2019 - September 2019",
                "description": "Led and executed an explainable AI project for Time Series in collaboration with Siemens Corporate Technology and their clients, resulting in a published paper and Erfindungsmeldung for the research demonstrator."
            }, {
                "company": "Freelancer",
                "title": "Machine Learning Consultant",
                "years": "July 2018 - October 2018",
                "description": "During a short transition phase before my PhD position, I worked as a freelance machine learning consultant with Steinbeis and Siemens CT to develop a system for explainable AI on time series classification tasks."
            }, {
                "company": "Steinbeis Kompetenzzentrum",
                "title": "Student Research Assistant",
                "years": "October 2017 - June 2018",
                "description": "To work primarily on industry projects, I worked for several months for Steinbeis in cooperation with the LKA NRW and Siemens CT. There I was part of a team working on predictive policing and predictive maintenance time series analysis."
            }, {
                "company": "University of Konstanz",
                "title": "Student Research Assistant",
                "years": "March 2015 - June 2018",
                "description": "During my time as a student research assistant, I started with the maintenance and support of the web pages of the department and projects of Prof. Dr. Daniel Keim. However, I was eager to extend my knowledge of data analysis and project research. I was part of various projects ranging from energy network analysis to predictive policing to 3D point cloud analysis. Notably, the predictive policing caught me and guided me to my master thesis about crime forecasting using deep learning."
            }
        ],
        "skills": [
            {
                "name": "Git",
                "level": "60%"
            }, {
                "name": "Illustrator",
                "level": "55%"
            }, {
                "name": "ReactJs",
                "level": "50%"
            }, {
                "name": "CSS",
                "level": "90%"
            }, {
                "name": "HTML5",
                "level": "80%"
            }, {
                "name": "VueJs",
                "level": "50%"
            }, {
                "name": "MongoDB",
                "level": "80%"
            }
        ]
    },
    "portfolio": {
        "projects": [
            {
                "title": "Canadian Wanderlust",
                "category": "My Travel Blog for my post-university travels",
                "image": "canadian-wanderlust.jpg",
                "url": "https://www.canadianwanderlust.com"
            }, {
                "title": "Fury Fighting Gear",
                "category": "(offline now) A fighting gear company I started",
                "image": "fury-fighting-gear.jpg",
                "url": "http://www.timbakerdev.com"
            }, {
                "title": "Original Thai Food",
                "category": "Website I built for a restaurant I like in Thailand",
                "image": "original-thai-food.jpg",
                "url": "http://www.timbakerdev.com/originalthaifood.github.io"
            }, {
                "title": "Resume Website",
                "category": "A React based resume website template",
                "image": "resume-website.jpg",
                "url": "http://www.timbakerdev.com"
            }, {
                "title": "Smirkspace",
                "category": "(MVP Only) A React and Meteor based chat University project.",
                "image": "smirkspace.jpg",
                "url": "http://www.smirkspace.com"
            }
        ]
    },
    "testimonials": {
        "testimonials": [
            {
                "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
                "user": "Kareem Abdul Jabbar"
            }, {
                "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
                "user": "Steve Wozniak... impersonator"
            }
        ]
    }
}